; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	thermograph5 - mode
	spectrograph1 - mode
	infrared3 - mode
	infrared2 - mode
	infrared4 - mode
	Star0 - direction
	Star3 - direction
	Star4 - direction
	Star1 - direction
	Star2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared3)
	(supports instrument1 infrared4)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared4)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Planet5 infrared4)
	(have_image Phenomenon6 spectrograph1)
	(have_image Phenomenon6 image0)
	(have_image Star7 infrared4)
	(have_image Planet8 infrared3)
	(have_image Planet8 infrared4)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon9 thermograph5)
	(have_image Phenomenon10 infrared2)
	(have_image Phenomenon11 spectrograph1)
	(have_image Phenomenon11 infrared2)
	(have_image Phenomenon12 infrared4)
	(have_image Phenomenon12 infrared3)
	(have_image Star13 image0)
	(have_image Star13 thermograph5)
	(have_image Star14 infrared2)
))

)

; plan
1. (turn_to satellite0 star1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star1)
   goals met: 0 of 17
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 17
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 17
4. (turn_to satellite0 phenomenon9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 17
5. (take_image satellite0 phenomenon9 instrument0 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 1 of 17
6. (turn_to satellite0 phenomenon6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 17
7. (take_image satellite0 phenomenon6 instrument0 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 2 of 17
8. (take_image satellite0 phenomenon6 instrument0 image0)
   added: (have_image phenomenon6 image0)
   goals met: 3 of 17
9. (turn_to satellite0 phenomenon11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 17
10. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 4 of 17
11. (take_image satellite0 phenomenon11 instrument0 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 5 of 17
12. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 17
13. (take_image satellite0 phenomenon10 instrument0 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 6 of 17
14. (turn_to satellite0 star13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star13)
   goals met: 6 of 17
15. (take_image satellite0 star13 instrument0 image0)
   added: (have_image star13 image0)
   goals met: 7 of 17
16. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 7 of 17
17. (take_image satellite0 star14 instrument0 infrared2)
   added: (have_image star14 infrared2)
   goals met: 8 of 17
18. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 8 of 17
19. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 8 of 17
20. (turn_to satellite0 star1 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star1)
   goals met: 8 of 17
21. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 8 of 17
22. (turn_to satellite0 phenomenon12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon12)
   goals met: 8 of 17
23. (take_image satellite0 phenomenon12 instrument1 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 9 of 17
24. (take_image satellite0 phenomenon12 instrument1 infrared4)
   added: (have_image phenomenon12 infrared4)
   goals met: 10 of 17
25. (turn_to satellite0 phenomenon9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon9)
   goals met: 10 of 17
26. (take_image satellite0 phenomenon9 instrument1 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 11 of 17
27. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   goals met: 11 of 17
28. (take_image satellite0 planet5 instrument1 infrared4)
   added: (have_image planet5 infrared4)
   goals met: 12 of 17
29. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   goals met: 12 of 17
30. (take_image satellite0 planet8 instrument1 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 13 of 17
31. (take_image satellite0 planet8 instrument1 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 14 of 17
32. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 14 of 17
33. (take_image satellite0 star13 instrument1 thermograph5)
   added: (have_image star13 thermograph5)
   goals met: 15 of 17
34. (turn_to satellite0 star7 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star7)
   goals met: 15 of 17
35. (take_image satellite0 star7 instrument1 infrared4)
   added: (have_image star7 infrared4)
   goals met: 16 of 17
36. (turn_to satellite0 star3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star3)
   goals met: 17 of 17
